In [1]:
# importing all required libraries

import pandas as pd

In [2]:
df=pd.read_csv("Titanic-Dataset.csv",)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
df=df.drop(["PassengerId","Name","Cabin","Ticket","Embarked","Fare"],axis=1)

In [5]:
y=df["Survived"]
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [6]:
X=df.drop("Survived",axis=1)

In [7]:
X

     Pclass     Sex   Age  SibSp  Parch
0         3    male  22.0      1      0
1         1  female  38.0      1      0
2         3  female  26.0      0      0
3         1  female  35.0      1      0
4         3    male  35.0      0      0
..      ...     ...   ...    ...    ...
886       2    male  27.0      0      0
887       1  female  19.0      0      0
888       3  female   NaN      1      2
889       1    male  26.0      0      0
890       3    male  32.0      0      0

[891 rows x 5 columns]

In [8]:
list(df["Age"].value_counts())

[30,
 27,
 26,
 25,
 25,
 25,
 24,
 23,
 22,
 20,
 18,
 18,
 18,
 18,
 17,
 17,
 15,
 15,
 15,
 15,
 14,
 13,
 13,
 13,
 12,
 11,
 10,
 10,
 10,
 9,
 9,
 9,
 8,
 8,
 7,
 7,
 6,
 6,
 6,
 6,
 6,
 6,
 5,
 5,
 5,
 4,
 4,
 4,
 4,
 4,
 4,
 3,
 3,
 3,
 3,
 3,
 2,
 2,
 2,
 2,
 2,
 2,
 2,
 2,
 2,
 2,
 2,
 2,
 2,
 2,
 2,
 2,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1]

In [9]:
X["Age"]=X["Age"].fillna(X["Age"].mode())

In [10]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    int64
 1   Sex     891 non-null    object
 2   Age     714 non-null    float64
 3   SibSp   891 non-null    int64
 4   Parch   891 non-null    int64
dtypes: float64(1), int64(3), object(1)
memory usage: 34.9+ KB

In [11]:
X["Age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [12]:
X["Age"]=X["Age"].fillna(X["Age"].mode()[0])

In [13]:
X["Age"]   # Now we can see nan values we changed with mode values of ages

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    24.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [14]:
X=pd.get_dummies(X,columns=["Sex"],drop_first=True)
X

     Pclass   Age  SibSp  Parch  Sex_male
0         3  22.0      1      0         1
1         1  38.0      1      0         0
2         3  26.0      0      0         0
3         1  35.0      1      0         0
4         3  35.0      0      0         1
..      ...   ...    ...    ...       ...
886       2  27.0      0      0         1
887       1  19.0      0      0         0
888       3  24.0      1      2         0
889       1  26.0      0      0         1
890       3  32.0      0      0         1

[891 rows x 5 columns]

In [15]:

type(X)

pandas.core.frame.DataFrame

In [16]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=30,random_state=43,stratify=y)

In [17]:

X_train

     Pclass   Age  SibSp  Parch  Sex_male
116       3  70.5      0      0         1
131       3  20.0      0      0         1
235       3  24.0      0      0         0
413       2  24.0      0      0         1
739       3  24.0      0      0         1
..      ...   ...    ...    ...       ...
365       3  30.0      0      0         1
44        3  19.0      0      0         0
341       1  24.0      3      2         0
609       1  40.0      0      0         0
433       3  17.0      0      0         1

[861 rows x 5 columns]

In [18]:
from sklearn.preprocessing import MinMaxScaler

In [19]:
scaleing=MinMaxScaler()

In [20]:
X_train=scaleing.fit_transform(X_train)

In [21]:
X_test=scaleing.transform(X_test)

In [22]:
from sklearn.svm import SVC

In [23]:
model=SVC(kernel="poly",degree=5)  #kernel="poly",degree=5,gamma="auto"

In [24]:
model.fit(X_train,y_train)

SVC(degree=5, kernel='poly')

In [25]:
model.score(X_train,y_train)

0.8315911730545877

In [26]:
X.head()

   Pclass   Age  SibSp  Parch  Sex_male
0       3  22.0      1      0         1
1       1  38.0      1      0         0
2       3  26.0      0      0         0
3       1  35.0      1      0         0
4       3  35.0      0      0         1

In [27]:
data=pd.DataFrame({"Pclass":[1],"Age":[25],"SibSp":[2],"Parch":[2],"Sex_male":[0]})
data

   Pclass  Age  SibSp  Parch  Sex_male
0       1   25      2      2         0

In [28]:
scaled_data=scaleing.transform(data)
scaled_data

array([[0.        , 0.30887158, 0.25      , 0.4       , 0.        ]])

In [29]:
model.predict(scaled_data)

array([1], dtype=int64)